{"class_name": "Sequential", "config": {"name": "sequential_282", "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_2450_input"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2450", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 10]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2679", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2451", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 224, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2680", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 224]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2452", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 176, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 224]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2681", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 176]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2453", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 240, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 176]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2682", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 240]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2454", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 48, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 240]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2683", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 48]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2455", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 96, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2684", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 96]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2456", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 160, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 96]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2685", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 160]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2457", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 48, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 160]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2686", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 48]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2458", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 224, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 48]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2687", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 224]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2459", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 224, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 224]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2688", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 224]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2460", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 224]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2689", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 80]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2461", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 96, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 80]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2690", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 96]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2462", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 96]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2691", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 80]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2463", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 160, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 80]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2692", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 160]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2464", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 96, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 160]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2693", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 96]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2465", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 96]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2694", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2466", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 192, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2695", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 192]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2467", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "units": 192, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0010000000474974513}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 192]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2696", "trainable": true, "dtype": "float32", "rate": 0.7697794339563117, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 192]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 192]}}]}, "keras_version": "2.13.1", "backend": "tensorflow"}